import pandas as pd
import numpy as np

data = {
    '이름' : ['유재석', '박명수', '정준하', '노홍철', '정형돈', '하하'],
    '지역' : ['서울', '부산', '부산', '서울', '서울', '서울'],
    '나이' : [19, 23, 20, 25, 18, 21],
    '국어점수' : [86, 90, 80, 65, 50, 60],
    '수학점수' : [86, 100, 66, 70, 40, 80],
    '코딩' : ['Python', 'Java', np.nan, 'Javascript', 'PYTHON', np.nan]
}

#      이름  지역  나이  국어점수  수학점수          코딩
# 1번  유재석  서울  19    86    86      Python
# 2번  박명수  부산  23    90   100        Java
# 3번  정준하  부산  20    80    66         NaN
# 4번  노홍철  서울  25    65    70  Javascript
# 5번  정형돈  서울  18    50    40      PYTHON
# 6번   하하  서울  21    60    80         NaN

df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번'])
print(df)

#df.info()는 Pandas에서 DataFrame의 전체적인 정보를 요약
df.info()

#          나이       국어점수        수학점수
# count   6.000000   6.000000    6.000000
# mean   21.000000  71.833333   73.666667
# std     2.607681  15.879757   20.451569
# min    18.000000  50.000000   40.000000
# 25%    19.250000  61.250000   67.000000
# 50%    20.500000  72.500000   75.000000
# 75%    22.500000  84.500000   84.500000
# max    25.000000  90.000000  100.000000

# 수치형 데이타에 대한 요약 정보 통계
print(df.describe())
print(df.head(6))
print(df.tail(3))


print(df['국어점수'].describe())
print(df['국어점수'].count())
print(df['국어점수'].min())
print(df['국어점수'].max())

print(df['국어점수'].sum())